# HasValidNumericRevisionSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..HasValidNumericRevisionSettings Method
RevisionNumberingSequence Class See Also
---
Checks whether the revision numbering sequence owns a valid numeric revision settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool HasValidNumericRevisionSettings()
```

Visual Basic
---
```text
Public Function HasValidNumericRevisionSettings As Boolean
```

Visual C++
---
```text
public:
bool HasValidNumericRevisionSettings()
```

# ### Return Value
True if the revision numbering sequence owns a valid numeric revision settings.
# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace